wintsa123/esp32BMSGPS/components/esp_bms_lvgl_bridge/esp_bms_lvgl_bridge.c
#include "esp_bms_lvgl_bridge.h"

#include <stdbool.h>
#include <stddef.h>
#include <string.h>
#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "driver/ledc.h"
#include "driver/spi_master.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_lcd_io_i2c.h"
#include "esp_lcd_io_i80.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_vendor.h"
#include "esp_lcd_touch.h"
#include "esp_lcd_touch_ft5x06.h"
#include "esp_lcd_touch_gt1151.h"
#include "esp_lcd_touch_gt911.h"
#include "esp_lcd_touch_cst816s.h"
#include "esp_lcd_touch_xpt2046.h"
#include "esp_lcd_ili9488.h"
#include "esp_lcd_ili9341.h"
#include "esp_lcd_gc9a01.h"
#include "esp_lcd_st7796.h"
#include "esp_bms_lvgl_contract.h"
#include "esp_lv_adapter.h"
#include "esp_lv_adapter_input.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "nvs.h"
#include "soc/soc_caps.h"

static const char *TAG = "bms_lvgl_bridge";

#define BACKLIGHT_PWM_FREQ_HZ 5000U
#define BACKLIGHT_PWM_DUTY_BITS 10U
#define BACKLIGHT_PWM_DUTY_MAX ((1U << BACKLIGHT_PWM_DUTY_BITS) - 1U)
#define BACKLIGHT_PWM_MODE LEDC_LOW_SPEED_MODE
#define BACKLIGHT_PWM_TIMER LEDC_TIMER_0
#define BACKLIGHT_PWM_CHANNEL LEDC_CHANNEL_0
#define LVGL_SPI_DRAW_BUFFER_HEIGHT CONFIG_ESP_BMS_LVGL_BRIDGE_SPI_DRAW_BUFFER_HEIGHT
#define LVGL_TASK_MAX_DELAY_MS CONFIG_ESP_BMS_LVGL_BRIDGE_TASK_MAX_DELAY_MS
#define TOUCH_CALIBRATION_VERSION 1U
#define TOUCH_CALIBRATION_POINT_COUNT 4U
#define TOUCH_CALIBRATION_NVS_NAMESPACE "esp_bms"
#define TOUCH_CALIBRATION_NVS_KEY "touch_cal"
#define TOUCH_FILTER_HISTORY_COUNT 3U
#define TOUCH_FILTER_MIN_SPIKE_DISTANCE 24U
#define TOUCH_FILTER_MAX_SPEED_PX_PER_MS 4U
#define TOUCH_FILTER_LOG_INTERVAL_MS 1000U
#define TOUCH_FILTER_PRESS_STABILITY_DISTANCE 16U
#if CONFIG_ESP_BMS_LVGL_BRIDGE_DOUBLE_BUFFER
#define LVGL_REQUIRE_DOUBLE_BUFFER true
#else
#define LVGL_REQUIRE_DOUBLE_BUFFER false
#endif

static esp_lcd_panel_io_handle_t s_panel_io;
static esp_lcd_panel_handle_t s_panel;
static esp_lcd_panel_io_handle_t s_touch_io;
static esp_lcd_touch_handle_t s_touch;
static i2c_master_bus_handle_t s_touch_i2c_bus;
static lv_display_t *s_display;
static lv_indev_t *s_touch_indev;
static gpio_num_t s_backlight_pin = GPIO_NUM_NC;
static esp_bms_display_rotation_t s_rotation = ESP_BMS_DISPLAY_ROTATION_LANDSCAPE;
static uint16_t s_physical_width;
static uint16_t s_physical_height;
static bool s_touch_base_swap_xy;
static bool s_touch_base_mirror_x;
static bool s_touch_base_mirror_y;
static bool s_backlight_pwm_ready;
static bool s_initialized;
static TickType_t s_touch_last_log_tick;
static TickType_t s_touch_last_filter_log_tick;
static bool s_touch_read_callback_logged;
static bool s_touch_was_pressed;

typedef struct {
    uint16_t x[TOUCH_FILTER_HISTORY_COUNT];
    uint16_t y[TOUCH_FILTER_HISTORY_COUNT];
    uint16_t accepted_x;
    uint16_t accepted_y;
    uint16_t candidate_x;
    uint16_t candidate_y;
    TickType_t accepted_tick;
    uint8_t count;
    bool candidate_pending;
    bool pressed;
    bool reported;
} touch_filter_t;

typedef enum {
    TOUCH_FILTER_HOLD,
    TOUCH_FILTER_ACCEPT,
    TOUCH_FILTER_REJECTED_SPIKE,
} touch_filter_result_t;

static touch_filter_t s_touch_filter;

typedef struct {
    uint32_t version;
    int32_t x_min;
    int32_t x_max;
    int32_t y_min;
    int32_t y_max;
} touch_calibration_t;

typedef struct {
    touch_calibration_t previous;
    int32_t observed_x[TOUCH_CALIBRATION_POINT_COUNT];
    int32_t observed_y[TOUCH_CALIBRATION_POINT_COUNT];
    int32_t target_x[TOUCH_CALIBRATION_POINT_COUNT];
    int32_t target_y[TOUCH_CALIBRATION_POINT_COUNT];
    uint8_t seen_mask;
    bool active;
    bool previous_valid;
} touch_calibration_session_t;

static touch_calibration_t s_touch_calibration;
static touch_calibration_session_t s_touch_calibration_session;
static bool s_touch_calibration_valid;

static void touch_rotation_flags(esp_bms_display_rotation_t rotation,
                                 bool *swap_xy,
                                 bool *mirror_x,
                                 bool *mirror_y);

static int32_t clamp_coordinate(int32_t value, int32_t maximum)
{
    if (value < 0) {
        return 0;
    }
    return value > maximum ? maximum : value;
}

static void touch_display_to_canonical(uint16_t display_x,
                                       uint16_t display_y,
                                       int32_t *canonical_x,
                                       int32_t *canonical_y)
{
    bool swap_xy = false;
    bool mirror_x = false;
    bool mirror_y = false;
    touch_rotation_flags(s_rotation, &swap_xy, &mirror_x, &mirror_y);

    int32_t x = display_x;
    int32_t y = display_y;
    if (swap_xy) {
        const int32_t temporary = x;
        x = y;
        y = temporary;
    }
    if (mirror_x) {
        x = (int32_t)s_physical_width - x;
    }
    if (mirror_y) {
        y = (int32_t)s_physical_height - y;
    }
    *canonical_x = clamp_coordinate(x, s_physical_width);
    *canonical_y = clamp_coordinate(y, s_physical_height);
}

static void touch_canonical_to_display(int32_t canonical_x,
                                       int32_t canonical_y,
                                       uint16_t *display_x,
                                       uint16_t *display_y)
{
    bool swap_xy = false;
    bool mirror_x = false;
    bool mirror_y = false;
    touch_rotation_flags(s_rotation, &swap_xy, &mirror_x, &mirror_y);

    int32_t x = clamp_coordinate(canonical_x, s_physical_width);
    int32_t y = clamp_coordinate(canonical_y, s_physical_height);
    if (mirror_x) {
        x = (int32_t)s_physical_width - x;
    }
    if (mirror_y) {
        y = (int32_t)s_physical_height - y;
    }
    if (swap_xy) {
        const int32_t temporary = x;
        x = y;
        y = temporary;
    }

    const int32_t display_width = (s_rotation == ESP_BMS_DISPLAY_ROTATION_LANDSCAPE ||
                                   s_rotation == ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE)
                                      ? s_physical_height
                                      : s_physical_width;
    const int32_t display_height = (s_rotation == ESP_BMS_DISPLAY_ROTATION_LANDSCAPE ||
                                    s_rotation == ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE)
                                       ? s_physical_width
                                       : s_physical_height;
    *display_x = (uint16_t)clamp_coordinate(x, display_width - 1);
    *display_y = (uint16_t)clamp_coordinate(y, display_height - 1);
}

static bool touch_calibration_valid(const touch_calibration_t *calibration)
{
    if (!calibration || calibration->version != TOUCH_CALIBRATION_VERSION) {
        return false;
    }
    const int32_t x_span = calibration->x_max - calibration->x_min;
    const int32_t y_span = calibration->y_max - calibration->y_min;
    return x_span >= (int32_t)s_physical_width / 2 &&
           x_span <= (int32_t)s_physical_width * 2 &&
           y_span >= (int32_t)s_physical_height / 2 &&
           y_span <= (int32_t)s_physical_height * 2 &&
           calibration->x_min >= -(int32_t)s_physical_width &&
           calibration->x_max <= (int32_t)s_physical_width * 2 &&
           calibration->y_min >= -(int32_t)s_physical_height &&
           calibration->y_max <= (int32_t)s_physical_height * 2;
}

static int32_t touch_calibration_map(int32_t value, int32_t minimum, int32_t maximum, int32_t output_max)
{
    const int32_t span = maximum - minimum;
    if (span <= 0) {
        return clamp_coordinate(value, output_max);
    }
    const int64_t scaled = ((int64_t)value - minimum) * output_max;
    return clamp_coordinate((int32_t)(scaled / span), output_max);
}

static void touch_calibration_apply(esp_lcd_touch_point_data_t *points, uint8_t count)
{
    if (!s_touch_calibration_valid || !points) {
        return;
    }
    for (uint8_t index = 0; index < count; ++index) {
        int32_t canonical_x = 0;
        int32_t canonical_y = 0;
        touch_display_to_canonical(points[index].x, points[index].y, &canonical_x, &canonical_y);
        canonical_x = touch_calibration_map(canonical_x,
                                            s_touch_calibration.x_min,
                                            s_touch_calibration.x_max,
                                            s_physical_width - 1);
        canonical_y = touch_calibration_map(canonical_y,
                                            s_touch_calibration.y_min,
                                            s_touch_calibration.y_max,
                                            s_physical_height - 1);
        touch_canonical_to_display(canonical_x, canonical_y, &points[index].x, &points[index].y);
    }
}

static uint16_t touch_abs_difference(uint16_t left, uint16_t right)
{
    return left >= right ? left - right : right - left;
}

static uint16_t touch_median3(uint16_t first, uint16_t second, uint16_t third)
{
    if (first > second) {
        const uint16_t temporary = first;
        first = second;
        second = temporary;
    }
    if (second > third) {
        const uint16_t temporary = second;
        second = third;
        third = temporary;
    }
    return first > second ? first : second;
}

static void touch_filter_reset(void)
{
    memset(&s_touch_filter, 0, sizeof(s_touch_filter));
}

static uint16_t touch_filter_spike_limit(TickType_t now)
{
    const TickType_t elapsed_ticks = now - s_touch_filter.accepted_tick;
    const uint32_t elapsed_ms = (uint32_t)pdTICKS_TO_MS(elapsed_ticks);
    const uint32_t limit = TOUCH_FILTER_MIN_SPIKE_DISTANCE +
                           elapsed_ms * TOUCH_FILTER_MAX_SPEED_PX_PER_MS;
    return limit > UINT16_MAX ? UINT16_MAX : (uint16_t)limit;
}

static bool touch_filter_is_spike(uint16_t x, uint16_t y, uint16_t limit)
{
    const uint32_t distance = (uint32_t)touch_abs_difference(x, s_touch_filter.accepted_x) +
                              (uint32_t)touch_abs_difference(y, s_touch_filter.accepted_y);
    return distance > limit;
}

