wintsa123/esp32BMSGPS/components/esp_bms_lvgl_bridge/esp_bms_lvgl_bridge.c
static void touch_filter_push(uint16_t x, uint16_t y)
{
    if (s_touch_filter.count < TOUCH_FILTER_HISTORY_COUNT) {
        s_touch_filter.x[s_touch_filter.count] = x;
        s_touch_filter.y[s_touch_filter.count] = y;
        s_touch_filter.count++;
        return;
    }

    s_touch_filter.x[0] = s_touch_filter.x[1];
    s_touch_filter.x[1] = s_touch_filter.x[2];
    s_touch_filter.x[2] = x;
    s_touch_filter.y[0] = s_touch_filter.y[1];
    s_touch_filter.y[1] = s_touch_filter.y[2];
    s_touch_filter.y[2] = y;
}

static touch_filter_result_t touch_filter_apply(esp_lcd_touch_point_data_t *point, TickType_t now)
{
    if (!s_touch_filter.pressed) {
        touch_filter_reset();
        s_touch_filter.pressed = true;
        s_touch_filter.candidate_x = point->x;
        s_touch_filter.candidate_y = point->y;
        return TOUCH_FILTER_HOLD;
    }

    if (!s_touch_filter.reported) {
        const uint32_t candidate_distance =
            (uint32_t)touch_abs_difference(point->x, s_touch_filter.candidate_x) +
            (uint32_t)touch_abs_difference(point->y, s_touch_filter.candidate_y);
        if (candidate_distance > TOUCH_FILTER_PRESS_STABILITY_DISTANCE) {
            s_touch_filter.candidate_x = point->x;
            s_touch_filter.candidate_y = point->y;
            return TOUCH_FILTER_HOLD;
        }

        s_touch_filter.reported = true;
        s_touch_filter.accepted_x = point->x;
        s_touch_filter.accepted_y = point->y;
        s_touch_filter.accepted_tick = now;
        touch_filter_push(s_touch_filter.candidate_x, s_touch_filter.candidate_y);
        touch_filter_push(point->x, point->y);
        return TOUCH_FILTER_ACCEPT;
    }

    const uint16_t limit = touch_filter_spike_limit(now);
    const bool spike = touch_filter_is_spike(point->x, point->y, limit);
    if (spike && (!s_touch_filter.candidate_pending ||
                  touch_abs_difference(point->x, s_touch_filter.candidate_x) +
                          touch_abs_difference(point->y, s_touch_filter.candidate_y) > limit)) {
        s_touch_filter.candidate_x = point->x;
        s_touch_filter.candidate_y = point->y;
        s_touch_filter.candidate_pending = true;
        point->x = s_touch_filter.accepted_x;
        point->y = s_touch_filter.accepted_y;
        return TOUCH_FILTER_REJECTED_SPIKE;
    }

    if (spike) {
        s_touch_filter.count = 0;
        touch_filter_push(s_touch_filter.candidate_x, s_touch_filter.candidate_y);
    }
    s_touch_filter.candidate_pending = false;
    touch_filter_push(point->x, point->y);
    if (s_touch_filter.count == TOUCH_FILTER_HISTORY_COUNT) {
        point->x = touch_median3(s_touch_filter.x[0], s_touch_filter.x[1], s_touch_filter.x[2]);
        point->y = touch_median3(s_touch_filter.y[0], s_touch_filter.y[1], s_touch_filter.y[2]);
    }
    s_touch_filter.accepted_x = point->x;
    s_touch_filter.accepted_y = point->y;
    s_touch_filter.accepted_tick = now;
    return TOUCH_FILTER_ACCEPT;
}

static bool touch_calibration_axis(const int32_t observed[TOUCH_CALIBRATION_POINT_COUNT],
                                   const int32_t target[TOUCH_CALIBRATION_POINT_COUNT],
                                   int32_t coordinate_max,
                                   int32_t *minimum,
                                   int32_t *maximum)
{
    int32_t observed_low = 0;
    int32_t observed_high = 0;
    int32_t target_low = 0;
    int32_t target_high = 0;
    uint8_t low_count = 0;
    uint8_t high_count = 0;

    for (uint8_t index = 0; index < TOUCH_CALIBRATION_POINT_COUNT; ++index) {
        if (target[index] < coordinate_max / 2) {
            observed_low += observed[index];
            target_low += target[index];
            low_count++;
        } else {
            observed_high += observed[index];
            target_high += target[index];
            high_count++;
        }
    }
    if (low_count != 2U || high_count != 2U) {
        return false;
    }

    observed_low /= low_count;
    observed_high /= high_count;
    target_low /= low_count;
    target_high /= high_count;
    const int32_t observed_span = observed_high - observed_low;
    const int32_t target_span = target_high - target_low;
    if (observed_span < coordinate_max / 3 || target_span < coordinate_max / 3) {
        return false;
    }

    *minimum = observed_low - (int32_t)(((int64_t)target_low * observed_span) / target_span);
    *maximum = *minimum + (int32_t)(((int64_t)coordinate_max * observed_span) / target_span);
    return *maximum > *minimum;
}

static esp_err_t touch_calibration_save(const touch_calibration_t *calibration)
{
    nvs_handle_t handle = 0;
    ESP_RETURN_ON_ERROR(nvs_open(TOUCH_CALIBRATION_NVS_NAMESPACE, NVS_READWRITE, &handle),
                        TAG, "open touch calibration NVS failed");
    esp_err_t ret = nvs_set_blob(handle,
                                 TOUCH_CALIBRATION_NVS_KEY,
                                 calibration,
                                 sizeof(*calibration));
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);
    return ret;
}

static void touch_calibration_restore_previous(void)
{
    s_touch_calibration = s_touch_calibration_session.previous;
    s_touch_calibration_valid = s_touch_calibration_session.previous_valid;
    memset(&s_touch_calibration_session, 0, sizeof(s_touch_calibration_session));
}

static bool psram_can_hold_lvgl_buffers(size_t required_buffer_bytes,
                                        bool require_double_buffer,
                                        size_t *free_out,
                                        size_t *largest_out)
{
    const uint32_t psram_caps = MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT;
    const size_t psram_free = heap_caps_get_free_size(psram_caps);
    const size_t psram_largest = heap_caps_get_largest_free_block(psram_caps);
    if (free_out) {
        *free_out = psram_free;
    }
    if (largest_out) {
        *largest_out = psram_largest;
    }

#if CONFIG_SPIRAM
    const size_t buffer_count = require_double_buffer ? 2U : 1U;
    return psram_largest >= required_buffer_bytes &&
           psram_free >= required_buffer_bytes * buffer_count;
#else
    (void)required_buffer_bytes;
    (void)require_double_buffer;
    return false;
#endif
}

static uint16_t logical_hres(const esp_bms_lvgl_bridge_config_t *config)
{
    switch (config->rotation) {
    case ESP_BMS_DISPLAY_ROTATION_LANDSCAPE:
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE:
        return config->physical_height;
    case ESP_BMS_DISPLAY_ROTATION_PORTRAIT:
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_PORTRAIT:
    default:
        return config->physical_width;
    }
}

static uint16_t logical_vres(const esp_bms_lvgl_bridge_config_t *config)
{
    switch (config->rotation) {
    case ESP_BMS_DISPLAY_ROTATION_LANDSCAPE:
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE:
        return config->physical_width;
    case ESP_BMS_DISPLAY_ROTATION_PORTRAIT:
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_PORTRAIT:
    default:
        return config->physical_height;
    }
}

