wintsa123/esp32BMSGPS/components/esp_bms_lvgl_bridge/esp_bms_lvgl_bridge.c
static void rotation_flags(esp_bms_display_rotation_t rotation, bool *swap_xy, bool *mirror_x, bool *mirror_y)
{
    switch (rotation) {
    case ESP_BMS_DISPLAY_ROTATION_LANDSCAPE:
        *swap_xy = true;
        *mirror_x = true;
        *mirror_y = false;
        break;
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_PORTRAIT:
        *swap_xy = false;
        *mirror_x = true;
        *mirror_y = true;
        break;
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE:
        *swap_xy = true;
        *mirror_x = false;
        *mirror_y = true;
        break;
    case ESP_BMS_DISPLAY_ROTATION_PORTRAIT:
    default:
        *swap_xy = false;
        *mirror_x = false;
        *mirror_y = false;
        break;
    }
}

static void touch_rotation_flags(esp_bms_display_rotation_t rotation, bool *swap_xy, bool *mirror_x, bool *mirror_y)
{
    bool swap = s_touch_base_swap_xy;
    bool x_mirror = s_touch_base_mirror_x;
    bool y_mirror = s_touch_base_mirror_y;

    switch (rotation) {
    case ESP_BMS_DISPLAY_ROTATION_PORTRAIT:
        swap = !s_touch_base_swap_xy;
        x_mirror = !s_touch_base_mirror_x;
        y_mirror = s_touch_base_mirror_y;
        break;
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_PORTRAIT:
        swap = !s_touch_base_swap_xy;
        x_mirror = s_touch_base_mirror_x;
        y_mirror = !s_touch_base_mirror_y;
        break;
    case ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE:
        swap = s_touch_base_swap_xy;
        x_mirror = !s_touch_base_mirror_x;
        y_mirror = !s_touch_base_mirror_y;
        break;
    case ESP_BMS_DISPLAY_ROTATION_LANDSCAPE:
    default:
        break;
    }

    *swap_xy = swap;
    *mirror_x = x_mirror;
    *mirror_y = y_mirror;
}

static void touch_coordinate_range(bool swap_xy, uint16_t hres, uint16_t vres, uint16_t *x_max, uint16_t *y_max)
{
    *x_max = swap_xy ? vres : hres;
    *y_max = swap_xy ? hres : vres;
}

static esp_err_t configure_backlight(gpio_num_t pin, int on_level)
{
    s_backlight_pin = pin;
    s_backlight_pwm_ready = false;
    if (pin == GPIO_NUM_NC) {
        return ESP_OK;
    }

    const ledc_timer_config_t timer_config = {
        .speed_mode = BACKLIGHT_PWM_MODE,
        .duty_resolution = LEDC_TIMER_10_BIT,
        .timer_num = BACKLIGHT_PWM_TIMER,
        .freq_hz = BACKLIGHT_PWM_FREQ_HZ,
        .clk_cfg = LEDC_AUTO_CLK,
    };
    ESP_RETURN_ON_ERROR(ledc_timer_config(&timer_config), TAG, "configure backlight PWM timer failed");

    const ledc_channel_config_t channel_config = {
        .gpio_num = pin,
        .speed_mode = BACKLIGHT_PWM_MODE,
        .channel = BACKLIGHT_PWM_CHANNEL,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = BACKLIGHT_PWM_TIMER,
        .duty = 0,
        .hpoint = 0,
        .sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_NO_PD,
        .flags = {
            .output_invert = on_level ? 0 : 1,
        },
    };
    ESP_RETURN_ON_ERROR(ledc_channel_config(&channel_config), TAG, "configure backlight PWM channel failed");
    s_backlight_pwm_ready = true;
    return ESP_OK;
}

esp_err_t esp_bms_lvgl_bridge_set_brightness(uint8_t percent)
{
    if (s_backlight_pin == GPIO_NUM_NC) {
        return ESP_OK;
    }
    ESP_RETURN_ON_FALSE(s_backlight_pwm_ready, ESP_ERR_INVALID_STATE, TAG, "backlight PWM is not configured");

    if (percent > 100U) {
        percent = 100U;
    }
    const uint32_t duty = (BACKLIGHT_PWM_DUTY_MAX * (uint32_t)percent + 50U) / 100U;
    esp_err_t ret = ledc_set_duty(BACKLIGHT_PWM_MODE, BACKLIGHT_PWM_CHANNEL, duty);
    if (ret != ESP_OK) {
        return ret;
    }
    return ledc_update_duty(BACKLIGHT_PWM_MODE, BACKLIGHT_PWM_CHANNEL);
}

static esp_err_t set_backlight(gpio_num_t pin, int level)
{
    if (pin == GPIO_NUM_NC) {
        return ESP_OK;
    }
    return esp_bms_lvgl_bridge_set_brightness(level ? 100U : 0U);
}

static esp_err_t apply_touch_rotation(esp_bms_display_rotation_t rotation)
{
    if (!s_touch) {
        return ESP_OK;
    }

    bool swap_xy = false;
    bool mirror_x = false;
    bool mirror_y = false;
    touch_rotation_flags(rotation, &swap_xy, &mirror_x, &mirror_y);

    const uint16_t hres = (rotation == ESP_BMS_DISPLAY_ROTATION_LANDSCAPE ||
                           rotation == ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE)
                              ? s_physical_height
                              : s_physical_width;
    const uint16_t vres = (rotation == ESP_BMS_DISPLAY_ROTATION_LANDSCAPE ||
                           rotation == ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE)
                              ? s_physical_width
                              : s_physical_height;
    touch_coordinate_range(swap_xy, hres, vres, &s_touch->config.x_max, &s_touch->config.y_max);

    ESP_RETURN_ON_ERROR(esp_lcd_touch_set_swap_xy(s_touch, swap_xy), TAG, "set touch swap_xy failed");
    ESP_RETURN_ON_ERROR(esp_lcd_touch_set_mirror_x(s_touch, mirror_x), TAG, "set touch mirror_x failed");
    ESP_RETURN_ON_ERROR(esp_lcd_touch_set_mirror_y(s_touch, mirror_y), TAG, "set touch mirror_y failed");
    ESP_LOGI(TAG, "touch rotation swap_xy=%s mirror_x=%s mirror_y=%s x_max=%u y_max=%u",
             swap_xy ? "yes" : "no",
             mirror_x ? "yes" : "no",
             mirror_y ? "yes" : "no",
             (unsigned)s_touch->config.x_max,
             (unsigned)s_touch->config.y_max);
    return ESP_OK;
}

esp_err_t esp_bms_lvgl_bridge_set_rotation(esp_bms_display_rotation_t rotation)
{
    ESP_RETURN_ON_FALSE(s_initialized, ESP_ERR_INVALID_STATE, TAG, "bridge is not initialized");
    if (s_rotation == rotation) {
        return ESP_OK;
    }

    bool swap_xy = false;
    bool mirror_x = false;
    bool mirror_y = false;
    rotation_flags(rotation, &swap_xy, &mirror_x, &mirror_y);
    ESP_RETURN_ON_ERROR(esp_lcd_panel_swap_xy(s_panel, swap_xy), TAG, "set panel swap_xy failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_mirror(s_panel, mirror_x, mirror_y), TAG, "set panel mirror failed");
    ESP_RETURN_ON_ERROR(apply_touch_rotation(rotation), TAG, "set touch rotation failed");

    s_rotation = rotation;
    if (s_display) {
        const uint16_t hres = (rotation == ESP_BMS_DISPLAY_ROTATION_LANDSCAPE ||
                               rotation == ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE)
                                  ? s_physical_height
                                  : s_physical_width;
        const uint16_t vres = (rotation == ESP_BMS_DISPLAY_ROTATION_LANDSCAPE ||
                               rotation == ESP_BMS_DISPLAY_ROTATION_INVERTED_LANDSCAPE)
                                  ? s_physical_width
                                  : s_physical_height;
        lv_display_set_resolution(s_display, hres, vres);
        lv_obj_invalidate(lv_screen_active());
    }
    return ESP_OK;
}

static esp_err_t touch_read_with_diagnostics(esp_lcd_touch_handle_t tp,
                                             esp_lcd_touch_point_data_t *points,
                                             uint8_t *count,
                                             uint8_t max_count,
                                             void *user_ctx)
{
    (void)user_ctx;
    if (count) {
        *count = 0;
    }

    const TickType_t now = xTaskGetTickCount();
    if (!s_touch_read_callback_logged) {
        ESP_LOGI(TAG, "touch read callback active");
        s_touch_read_callback_logged = true;
    }

    esp_err_t ret = esp_lcd_touch_read_data(tp);
    if (ret != ESP_OK) {
        const bool was_pressed = s_touch_filter.pressed;
        touch_filter_reset();
        if (s_touch_last_log_tick == 0 ||
            now - s_touch_last_log_tick >= pdMS_TO_TICKS(1000)) {
            ESP_LOGW(TAG, "touch read failed: %s%s",
                     esp_err_to_name(ret),
                     was_pressed ? "; forcing release" : "");
            s_touch_last_log_tick = now;
        }
        return ret;
    }

