wintsa123/esp32BMSGPS/components/esp_bms_lvgl_bridge/esp_bms_lvgl_bridge.c
    ret = esp_lcd_touch_get_data(tp, points, count, max_count);
    if (ret != ESP_OK) {
        const bool was_pressed = s_touch_filter.pressed;
        touch_filter_reset();
        if (s_touch_last_log_tick == 0 ||
            now - s_touch_last_log_tick >= pdMS_TO_TICKS(1000)) {
            ESP_LOGW(TAG, "touch data failed: %s%s",
                     esp_err_to_name(ret),
                     was_pressed ? "; forcing release" : "");
            s_touch_last_log_tick = now;
        }
        return ret;
    }

    if (count && *count > 0U) {
        touch_calibration_apply(points, *count);
        const touch_filter_result_t filter_result = touch_filter_apply(&points[0], now);
        if (filter_result == TOUCH_FILTER_HOLD) {
            *count = 0;
        } else if (filter_result == TOUCH_FILTER_REJECTED_SPIKE &&
            (s_touch_last_filter_log_tick == 0 ||
             now - s_touch_last_filter_log_tick >= pdMS_TO_TICKS(TOUCH_FILTER_LOG_INTERVAL_MS))) {
            ESP_LOGW(TAG, "touch spike rejected candidate=%u,%u held=%u,%u",
                     (unsigned)s_touch_filter.candidate_x,
                     (unsigned)s_touch_filter.candidate_y,
                     (unsigned)points[0].x,
                     (unsigned)points[0].y);
            s_touch_last_filter_log_tick = now;
        }
    } else {
        touch_filter_reset();
    }

    const bool pressed = count && *count > 0U;
    if (pressed) {
        if (!s_touch_was_pressed ||
            s_touch_last_log_tick == 0 ||
            now - s_touch_last_log_tick >= pdMS_TO_TICKS(300)) {
            ESP_LOGI(TAG, "touch sample accepted count=%u x=%u y=%u strength=%u",
                     (unsigned)*count,
                     (unsigned)points[0].x,
                     (unsigned)points[0].y,
                     (unsigned)points[0].strength);
            s_touch_last_log_tick = now;
        }
        s_touch_was_pressed = true;
    } else if (s_touch_was_pressed) {
        ESP_LOGI(TAG, "touch released");
        s_touch_was_pressed = false;
        s_touch_last_log_tick = now;
    }

    return ESP_OK;
}

static esp_lcd_touch_config_t make_touch_config(const esp_bms_lvgl_bridge_config_t *config,
                                                uint16_t hres,
                                                uint16_t vres)
{
    s_touch_base_swap_xy = config->touch_swap_xy;
    s_touch_base_mirror_x = config->touch_mirror_x;
    s_touch_base_mirror_y = config->touch_mirror_y;

    bool touch_swap_xy = false;
    bool touch_mirror_x = false;
    bool touch_mirror_y = false;
    touch_rotation_flags(config->rotation, &touch_swap_xy, &touch_mirror_x, &touch_mirror_y);
    uint16_t touch_x_max = 0;
    uint16_t touch_y_max = 0;
    touch_coordinate_range(touch_swap_xy, hres, vres, &touch_x_max, &touch_y_max);
    return (esp_lcd_touch_config_t) {
        .x_max = touch_x_max,
        .y_max = touch_y_max,
        .rst_gpio_num = config->pin_touch_reset,
        .int_gpio_num = config->touch_use_irq ? config->pin_touch_irq : GPIO_NUM_NC,
        .levels = {
            .reset = config->touch_reset_level,
            .interrupt = config->touch_irq_level,
        },
        .flags = {
            .swap_xy = touch_swap_xy,
            .mirror_x = touch_mirror_x,
            .mirror_y = touch_mirror_y,
        },
    };
}

static esp_err_t register_touch(const esp_bms_lvgl_bridge_config_t *config)
{
    esp_lv_adapter_touch_config_t adapter_touch_config =
        ESP_LV_ADAPTER_TOUCH_DEFAULT_CONFIG(s_display, s_touch);
    adapter_touch_config.callbacks.custom_touch_read = touch_read_with_diagnostics;
    s_touch_indev = esp_lv_adapter_register_touch(&adapter_touch_config);
    ESP_RETURN_ON_FALSE(s_touch_indev, ESP_FAIL, TAG, "register LVGL touch failed");
    ESP_LOGI(TAG, "touch initialized driver=%d irq=%s", config->touch_driver,
             config->touch_use_irq ? "enabled" : "polling");
    return ESP_OK;
}

static esp_err_t init_touch_xpt2046(const esp_bms_lvgl_bridge_config_t *config,
                                    uint16_t hres,
                                    uint16_t vres)
{
    ESP_RETURN_ON_FALSE(config->pin_touch_sclk != GPIO_NUM_NC &&
                            config->pin_touch_mosi != GPIO_NUM_NC &&
                            config->pin_touch_miso != GPIO_NUM_NC &&
                            config->pin_touch_cs != GPIO_NUM_NC,
                        ESP_ERR_INVALID_ARG, TAG, "XPT2046 pins are incomplete");
    const spi_bus_config_t touch_bus_config = {
        .sclk_io_num = config->pin_touch_sclk,
        .mosi_io_num = config->pin_touch_mosi,
        .miso_io_num = config->pin_touch_miso,
        .quadwp_io_num = GPIO_NUM_NC,
        .quadhd_io_num = GPIO_NUM_NC,
        .max_transfer_sz = 256,
    };
    ESP_RETURN_ON_ERROR(spi_bus_initialize(SPI3_HOST, &touch_bus_config, SPI_DMA_CH_AUTO),
                        TAG, "initialize touch SPI bus failed");
    const esp_lcd_panel_io_spi_config_t touch_io_config =
        ESP_LCD_TOUCH_IO_SPI_XPT2046_CONFIG(config->pin_touch_cs);
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)SPI3_HOST,
                                                   &touch_io_config, &s_touch_io),
                        TAG, "create touch panel IO failed");
    const esp_lcd_touch_config_t touch_config = make_touch_config(config, hres, vres);
    ESP_RETURN_ON_ERROR(esp_lcd_touch_new_spi_xpt2046(s_touch_io, &touch_config, &s_touch),
                        TAG, "create XPT2046 touch failed");
    return register_touch(config);
}

static esp_err_t init_touch_i2c(const esp_bms_lvgl_bridge_config_t *config,
                                uint16_t hres,
                                uint16_t vres)
{
    ESP_RETURN_ON_FALSE(config->pin_touch_sda != GPIO_NUM_NC &&
                            config->pin_touch_scl != GPIO_NUM_NC &&
                            config->touch_i2c_address > 0U &&
                            config->touch_i2c_clock_hz > 0U,
                        ESP_ERR_INVALID_ARG, TAG, "I2C touch configuration is incomplete");
    const i2c_master_bus_config_t i2c_bus_config = {
        .i2c_port = -1,
        .sda_io_num = config->pin_touch_sda,
        .scl_io_num = config->pin_touch_scl,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = config->touch_i2c_internal_pullup,
    };
    ESP_RETURN_ON_ERROR(i2c_new_master_bus(&i2c_bus_config, &s_touch_i2c_bus),
                        TAG, "initialize touch I2C bus failed");
    const esp_lcd_panel_io_i2c_config_t touch_io_config = {
        .dev_addr = config->touch_i2c_address,
        .scl_speed_hz = config->touch_i2c_clock_hz,
        .control_phase_bytes = config->touch_i2c_control_phase_bytes,
        .dc_bit_offset = config->touch_i2c_dc_bit_offset,
        .lcd_cmd_bits = config->touch_i2c_cmd_bits,
        .lcd_param_bits = config->touch_i2c_param_bits,
        .flags.disable_control_phase = config->touch_i2c_disable_control_phase,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(s_touch_i2c_bus, &touch_io_config, &s_touch_io),
                        TAG, "create touch I2C panel IO failed");
    const esp_lcd_touch_config_t touch_config = make_touch_config(config, hres, vres);
    if (config->touch_driver == ESP_BMS_LVGL_TOUCH_FT5X06) {
        ESP_RETURN_ON_ERROR(esp_lcd_touch_new_i2c_ft5x06(s_touch_io, &touch_config, &s_touch),
                            TAG, "create FT5X06 touch failed");
    } else if (config->touch_driver == ESP_BMS_LVGL_TOUCH_GT1151) {
        ESP_RETURN_ON_ERROR(esp_lcd_touch_new_i2c_gt1151(s_touch_io, &touch_config, &s_touch),
                            TAG, "create GT1151 touch failed");
    } else if (config->touch_driver == ESP_BMS_LVGL_TOUCH_GT911) {
        ESP_RETURN_ON_ERROR(esp_lcd_touch_new_i2c_gt911(s_touch_io, &touch_config, &s_touch),
                            TAG, "create GT911 touch failed");
    } else if (config->touch_driver == ESP_BMS_LVGL_TOUCH_CST816S) {
        ESP_RETURN_ON_ERROR(esp_lcd_touch_new_i2c_cst816s(s_touch_io, &touch_config, &s_touch),
                            TAG, "create CST816S touch failed");
    } else {
        return ESP_ERR_NOT_SUPPORTED;
    }
    return register_touch(config);
}

static esp_err_t init_touch(const esp_bms_lvgl_bridge_config_t *config, uint16_t hres, uint16_t vres)
{
    if (config->touch_driver == ESP_BMS_LVGL_TOUCH_NONE) {
        ESP_LOGI(TAG, "touch disabled by profile");
        return ESP_OK;
    }
    ESP_RETURN_ON_FALSE(!config->touch_use_irq || config->pin_touch_irq != GPIO_NUM_NC,
                        ESP_ERR_INVALID_ARG, TAG, "touch IRQ is enabled without a GPIO");
    switch (config->touch_driver) {
    case ESP_BMS_LVGL_TOUCH_XPT2046:
        return init_touch_xpt2046(config, hres, vres);
    case ESP_BMS_LVGL_TOUCH_FT5X06:
    case ESP_BMS_LVGL_TOUCH_GT1151:
    case ESP_BMS_LVGL_TOUCH_GT911:
    case ESP_BMS_LVGL_TOUCH_CST816S:
        return init_touch_i2c(config, hres, vres);
    default:
        return ESP_ERR_NOT_SUPPORTED;
    }
}

static esp_err_t init_panel_spi(const esp_bms_lvgl_bridge_config_t *config, int max_transfer_sz)
{
    ESP_RETURN_ON_FALSE(config->panel_driver == ESP_BMS_LVGL_PANEL_ST7789 ||
                            config->panel_driver == ESP_BMS_LVGL_PANEL_ILI9341 ||
                            config->panel_driver == ESP_BMS_LVGL_PANEL_GC9A01,
                        ESP_ERR_NOT_SUPPORTED, TAG, "SPI panel driver is unsupported");
    const spi_bus_config_t bus_config = {
        .sclk_io_num = config->pin_sclk,
        .mosi_io_num = config->pin_mosi,
        .miso_io_num = config->pin_miso,
        .quadwp_io_num = GPIO_NUM_NC,
        .quadhd_io_num = GPIO_NUM_NC,
        .max_transfer_sz = max_transfer_sz,
    };
    ESP_RETURN_ON_ERROR(spi_bus_initialize(SPI2_HOST, &bus_config, SPI_DMA_CH_AUTO),
                        TAG, "initialize display SPI bus failed");
    const esp_lcd_panel_io_spi_config_t io_config = {
        .dc_gpio_num = config->pin_dc,
        .cs_gpio_num = config->pin_cs,
        .pclk_hz = config->pixel_clock_hz,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
        .spi_mode = config->spi_mode,
        .trans_queue_depth = 10,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)SPI2_HOST,
                                                   &io_config, &s_panel_io),
                        TAG, "create display SPI panel IO failed");
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = config->pin_reset,
        .rgb_ele_order = config->rgb_element_order,
        .data_endian = LCD_RGB_DATA_ENDIAN_BIG,
        .bits_per_pixel = 16,
    };
    if (config->panel_driver == ESP_BMS_LVGL_PANEL_ILI9341) {
        return esp_lcd_new_panel_ili9341(s_panel_io, &panel_config, &s_panel);
    }
    if (config->panel_driver == ESP_BMS_LVGL_PANEL_GC9A01) {
        return esp_lcd_new_panel_gc9a01(s_panel_io, &panel_config, &s_panel);
    }
    return esp_lcd_new_panel_st7789(s_panel_io, &panel_config, &s_panel);
}

