wintsa123/esp32BMSGPS/components/esp_bms_lvgl_bridge/esp_bms_lvgl_bridge.c
static esp_err_t init_panel_i80(const esp_bms_lvgl_bridge_config_t *config, int max_transfer_sz)
{
#if SOC_LCD_I80_SUPPORTED
    const esp_lcd_i80_bus_config_t bus_config = {
        .dc_gpio_num = config->pin_dc,
        .wr_gpio_num = config->pin_wr,
        .clk_src = LCD_CLK_SRC_DEFAULT,
        .data_gpio_nums = {
            config->i80_data_pins[0], config->i80_data_pins[1], config->i80_data_pins[2], config->i80_data_pins[3],
            config->i80_data_pins[4], config->i80_data_pins[5], config->i80_data_pins[6], config->i80_data_pins[7],
            config->i80_data_pins[8], config->i80_data_pins[9], config->i80_data_pins[10], config->i80_data_pins[11],
            config->i80_data_pins[12], config->i80_data_pins[13], config->i80_data_pins[14], config->i80_data_pins[15],
        },
        .bus_width = config->i80_bus_width,
        .max_transfer_bytes = (size_t)max_transfer_sz,
        .dma_burst_size = 64,
    };
    esp_lcd_i80_bus_handle_t i80_bus = NULL;
    ESP_RETURN_ON_ERROR(esp_lcd_new_i80_bus(&bus_config, &i80_bus), TAG, "initialize display I80 bus failed");
    const esp_lcd_panel_io_i80_config_t io_config = {
        .cs_gpio_num = config->pin_cs,
        .pclk_hz = config->pixel_clock_hz,
        .trans_queue_depth = 10,
        .dc_levels = {
            .dc_idle_level = 0,
            .dc_cmd_level = 0,
            .dc_dummy_level = 0,
            .dc_data_level = 1,
        },
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
        .flags = {
            .swap_color_bytes = config->i80_swap_color_bytes,
            .pclk_active_neg = config->i80_pclk_active_neg,
            .pclk_idle_low = config->i80_pclk_idle_low,
        },
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i80(i80_bus, &io_config, &s_panel_io),
                        TAG, "create display I80 panel IO failed");
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = config->pin_reset,
        .rgb_ele_order = config->rgb_element_order,
        .data_endian = LCD_RGB_DATA_ENDIAN_BIG,
        .bits_per_pixel = 16,
    };
    if (config->panel_driver == ESP_BMS_LVGL_PANEL_ST7796) {
        return esp_lcd_new_panel_st7796(s_panel_io, &panel_config, &s_panel);
    }
    if (config->panel_driver == ESP_BMS_LVGL_PANEL_ILI9488) {
        return esp_lcd_new_panel_ili9488(s_panel_io, &panel_config, 0, &s_panel);
    }
    return ESP_ERR_NOT_SUPPORTED;
#else
    (void)config;
    (void)max_transfer_sz;
    return ESP_ERR_NOT_SUPPORTED;
#endif
}

static esp_err_t init_panel(const esp_bms_lvgl_bridge_config_t *config, int max_transfer_sz)
{
    ESP_RETURN_ON_FALSE(config->pin_cs != GPIO_NUM_NC && config->pin_dc != GPIO_NUM_NC,
                        ESP_ERR_INVALID_ARG, TAG, "display CS/DC pins are required");
    switch (config->display_bus) {
    case ESP_BMS_LVGL_DISPLAY_BUS_SPI:
        ESP_RETURN_ON_FALSE(config->pin_sclk != GPIO_NUM_NC && config->pin_mosi != GPIO_NUM_NC,
                            ESP_ERR_INVALID_ARG, TAG, "display SPI pins are incomplete");
        return init_panel_spi(config, max_transfer_sz);
    case ESP_BMS_LVGL_DISPLAY_BUS_I80:
        ESP_RETURN_ON_FALSE(config->pin_wr != GPIO_NUM_NC &&
                                (config->i80_bus_width == 8U || config->i80_bus_width == 16U),
                            ESP_ERR_INVALID_ARG, TAG, "display I80 pins are incomplete");
        return init_panel_i80(config, max_transfer_sz);
    default:
        return ESP_ERR_NOT_SUPPORTED;
    }
}

esp_err_t esp_bms_lvgl_bridge_init(const esp_bms_lvgl_bridge_config_t *config)
{
    ESP_RETURN_ON_FALSE(config, ESP_ERR_INVALID_ARG, TAG, "config is required");
    ESP_RETURN_ON_FALSE(!s_initialized, ESP_ERR_INVALID_STATE, TAG, "bridge already initialized");
    ESP_RETURN_ON_FALSE(config->physical_width > 0 && config->physical_height > 0 &&
                            config->pixel_clock_hz > 0U,
                        ESP_ERR_INVALID_ARG, TAG, "invalid display configuration");

    const uint16_t hres = logical_hres(config);
    const uint16_t vres = logical_vres(config);
    const int max_transfer_sz = hres * LVGL_SPI_DRAW_BUFFER_HEIGHT * sizeof(uint16_t);
    const size_t draw_buffer_bytes = (size_t)max_transfer_sz;
    size_t psram_free = 0;
    size_t psram_largest = 0;
    const bool use_psram_buffers = psram_can_hold_lvgl_buffers(draw_buffer_bytes,
                                                               LVGL_REQUIRE_DOUBLE_BUFFER,
                                                               &psram_free,
                                                               &psram_largest);
    s_physical_width = config->physical_width;
    s_physical_height = config->physical_height;

    ESP_LOGI(TAG, "init display bus=%d panel=%d hres=%u vres=%u pclk=%lu",
             config->display_bus, config->panel_driver, hres, vres,
             (unsigned long)config->pixel_clock_hz);
    ESP_RETURN_ON_ERROR(configure_backlight(config->pin_backlight, config->backlight_on_level),
                        TAG, "configure backlight failed");
    if (config->power_on_delay_ms > 0U) {
        vTaskDelay(pdMS_TO_TICKS(config->power_on_delay_ms));
    }
    ESP_RETURN_ON_ERROR(init_panel(config, max_transfer_sz), TAG, "create display panel failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_reset(s_panel), TAG, "reset panel failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_init(s_panel), TAG, "init panel failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_invert_color(s_panel, config->invert_color),
                        TAG, "set inversion failed");

    bool swap_xy = false;
    bool mirror_x = false;
    bool mirror_y = false;
    rotation_flags(config->rotation, &swap_xy, &mirror_x, &mirror_y);
    ESP_RETURN_ON_ERROR(esp_lcd_panel_swap_xy(s_panel, swap_xy), TAG, "set panel swap_xy failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_mirror(s_panel, mirror_x, mirror_y), TAG, "set panel mirror failed");
    s_rotation = config->rotation;
    ESP_RETURN_ON_ERROR(esp_lcd_panel_disp_on_off(s_panel, true), TAG, "turn panel on failed");

    esp_lv_adapter_config_t adapter_config = ESP_LV_ADAPTER_DEFAULT_CONFIG();
    adapter_config.task_max_delay_ms = LVGL_TASK_MAX_DELAY_MS;
#if CONFIG_ESP_LVGL_ADAPTER_LVGL_THREAD_STACK_IN_PSRAM
    adapter_config.stack_in_psram = use_psram_buffers;
#endif
    ESP_RETURN_ON_ERROR(esp_lv_adapter_init(&adapter_config), TAG, "init LVGL adapter failed");
    esp_lv_adapter_display_config_t display_config =
        ESP_LV_ADAPTER_DISPLAY_SPI_WITHOUT_PSRAM_DEFAULT_CONFIG(
            s_panel, s_panel_io, hres, vres, ESP_LV_ADAPTER_ROTATE_0);
    display_config.profile.use_psram = use_psram_buffers;
    display_config.profile.buffer_height = LVGL_SPI_DRAW_BUFFER_HEIGHT;
    display_config.profile.require_double_buffer = LVGL_REQUIRE_DOUBLE_BUFFER;
    s_display = esp_lv_adapter_register_display(&display_config);
    ESP_RETURN_ON_FALSE(s_display, ESP_FAIL, TAG, "register adapter display failed");

    ESP_RETURN_ON_ERROR(init_touch(config, hres, vres), TAG, "init touch failed");
    ESP_RETURN_ON_ERROR(set_backlight(config->pin_backlight, config->backlight_on_level),
                        TAG, "turn backlight on failed");

    ESP_LOGI(TAG, "LVGL buffers height=%u double=%s psram=%s free=%u largest=%u",
             (unsigned)LVGL_SPI_DRAW_BUFFER_HEIGHT, LVGL_REQUIRE_DOUBLE_BUFFER ? "yes" : "no",
             use_psram_buffers ? "yes" : "no", (unsigned)psram_free, (unsigned)psram_largest);
    s_initialized = true;
    return ESP_OK;
}

esp_err_t esp_bms_lvgl_bridge_start(void)
{
    ESP_RETURN_ON_FALSE(s_initialized, ESP_ERR_INVALID_STATE, TAG, "bridge is not initialized");
    return esp_lv_adapter_start();
}

esp_err_t esp_bms_lvgl_bridge_lock(int32_t timeout_ms)
{
    return esp_lv_adapter_lock(timeout_ms);
}

void esp_bms_lvgl_bridge_unlock(void)
{
    esp_lv_adapter_unlock();
}

esp_err_t esp_bms_lvgl_bridge_write_rgb565(uint16_t x,
                                           uint16_t y,
                                           uint16_t width,
                                           uint16_t height,
                                           const uint8_t *pixels,
                                           size_t pixel_bytes)
{
    ESP_RETURN_ON_FALSE(s_initialized && s_panel && s_display,
                        ESP_ERR_INVALID_STATE,
                        TAG,
                        "bridge is not initialized");
    ESP_RETURN_ON_FALSE(pixels && width > 0U && height > 0U,
                        ESP_ERR_INVALID_ARG,
                        TAG,
                        "invalid RGB565 block");
    const uint16_t hres = lv_display_get_horizontal_resolution(s_display);
    const uint16_t vres = lv_display_get_vertical_resolution(s_display);
    const size_t expected = (size_t)width * height * sizeof(uint16_t);
    ESP_RETURN_ON_FALSE(pixel_bytes == expected && x < hres && y < vres &&
                            width <= hres - x && height <= vres - y,
                        ESP_ERR_INVALID_SIZE,
                        TAG,
                        "RGB565 block out of bounds");
    return esp_lcd_panel_draw_bitmap(s_panel, x, y, x + width, y + height, pixels);
}

