wintsa123/esp32BMSGPS/components/esp_bms_lvgl_bridge/esp_bms_lvgl_bridge.c
lv_display_t *esp_bms_lvgl_bridge_get_display(void)
{
    return s_display;
}

lv_indev_t *esp_bms_lvgl_bridge_get_touch(void)
{
    return s_touch_indev;
}

esp_err_t esp_bms_lvgl_bridge_load_touch_calibration(void)
{
    ESP_RETURN_ON_FALSE(s_initialized, ESP_ERR_INVALID_STATE, TAG, "bridge is not initialized");

    nvs_handle_t handle = 0;
    esp_err_t ret = nvs_open(TOUCH_CALIBRATION_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        s_touch_calibration_valid = false;
        return ESP_OK;
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "open touch calibration NVS failed");

    touch_calibration_t calibration = { 0 };
    size_t size = sizeof(calibration);
    ret = nvs_get_blob(handle, TOUCH_CALIBRATION_NVS_KEY, &calibration, &size);
    nvs_close(handle);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        s_touch_calibration_valid = false;
        return ESP_OK;
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "load touch calibration failed");
    if (size != sizeof(calibration) || !touch_calibration_valid(&calibration)) {
        s_touch_calibration_valid = false;
        ESP_LOGW(TAG, "ignoring invalid touch calibration blob");
        return ESP_OK;
    }

    s_touch_calibration = calibration;
    s_touch_calibration_valid = true;
    ESP_LOGI(TAG, "touch calibration loaded x=%ld..%ld y=%ld..%ld",
             (long)calibration.x_min,
             (long)calibration.x_max,
             (long)calibration.y_min,
             (long)calibration.y_max);
    return ESP_OK;
}

esp_err_t esp_bms_lvgl_bridge_begin_touch_calibration(void)
{
    ESP_RETURN_ON_FALSE(s_initialized && s_touch, ESP_ERR_INVALID_STATE, TAG, "touch is not initialized");
    ESP_RETURN_ON_FALSE(!s_touch_calibration_session.active,
                        ESP_ERR_INVALID_STATE, TAG, "touch calibration already active");

    memset(&s_touch_calibration_session, 0, sizeof(s_touch_calibration_session));
    s_touch_calibration_session.previous = s_touch_calibration;
    s_touch_calibration_session.previous_valid = s_touch_calibration_valid;
    s_touch_calibration_session.active = true;
    s_touch_calibration_valid = false;
    ESP_LOGI(TAG, "touch calibration started");
    return ESP_OK;
}

esp_err_t esp_bms_lvgl_bridge_add_touch_calibration_sample(uint8_t target_index,
                                                           uint16_t observed_x,
                                                           uint16_t observed_y,
                                                           uint16_t target_x,
                                                           uint16_t target_y,
                                                           bool *finished)
{
    ESP_RETURN_ON_FALSE(finished, ESP_ERR_INVALID_ARG, TAG, "finished output is required");
    *finished = false;
    ESP_RETURN_ON_FALSE(s_touch_calibration_session.active,
                        ESP_ERR_INVALID_STATE, TAG, "touch calibration is not active");
    ESP_RETURN_ON_FALSE(target_index < TOUCH_CALIBRATION_POINT_COUNT,
                        ESP_ERR_INVALID_ARG, TAG, "invalid touch calibration target");

    touch_display_to_canonical(observed_x,
                               observed_y,
                               &s_touch_calibration_session.observed_x[target_index],
                               &s_touch_calibration_session.observed_y[target_index]);
    touch_display_to_canonical(target_x,
                               target_y,
                               &s_touch_calibration_session.target_x[target_index],
                               &s_touch_calibration_session.target_y[target_index]);
    s_touch_calibration_session.seen_mask |= (uint8_t)(1U << target_index);
    ESP_LOGI(TAG, "touch calibration point=%u observed=%u,%u target=%u,%u",
             (unsigned)target_index,
             (unsigned)observed_x,
             (unsigned)observed_y,
             (unsigned)target_x,
             (unsigned)target_y);

    if (s_touch_calibration_session.seen_mask !=
        (uint8_t)((1U << TOUCH_CALIBRATION_POINT_COUNT) - 1U)) {
        return ESP_OK;
    }

    touch_calibration_t calibration = {
        .version = TOUCH_CALIBRATION_VERSION,
    };
    const bool valid = touch_calibration_axis(s_touch_calibration_session.observed_x,
                                              s_touch_calibration_session.target_x,
                                              s_physical_width,
                                              &calibration.x_min,
                                              &calibration.x_max) &&
                       touch_calibration_axis(s_touch_calibration_session.observed_y,
                                              s_touch_calibration_session.target_y,
                                              s_physical_height,
                                              &calibration.y_min,
                                              &calibration.y_max) &&
                       touch_calibration_valid(&calibration);
    if (!valid) {
        touch_calibration_restore_previous();
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = touch_calibration_save(&calibration);
    if (ret != ESP_OK) {
        touch_calibration_restore_previous();
        return ret;
    }

    s_touch_calibration = calibration;
    s_touch_calibration_valid = true;
    memset(&s_touch_calibration_session, 0, sizeof(s_touch_calibration_session));
    *finished = true;
    ESP_LOGI(TAG, "touch calibration saved x=%ld..%ld y=%ld..%ld",
             (long)calibration.x_min,
             (long)calibration.x_max,
             (long)calibration.y_min,
             (long)calibration.y_max);
    return ESP_OK;
}

void esp_bms_lvgl_bridge_cancel_touch_calibration(void)
{
    if (!s_touch_calibration_session.active) {
        return;
    }
    touch_calibration_restore_previous();
    ESP_LOGI(TAG, "touch calibration cancelled");
}

esp_err_t esp_bms_lvgl_bridge_reset_touch_calibration(void)
{
    if (s_touch_calibration_session.active) {
        memset(&s_touch_calibration_session, 0, sizeof(s_touch_calibration_session));
    }
    memset(&s_touch_calibration, 0, sizeof(s_touch_calibration));
    s_touch_calibration_valid = false;

    nvs_handle_t handle = 0;
    esp_err_t ret = nvs_open(TOUCH_CALIBRATION_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        return ESP_OK;
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "open touch calibration NVS failed");
    ret = nvs_erase_key(handle, TOUCH_CALIBRATION_NVS_KEY);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        ret = ESP_OK;
    }
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);
    return ret;
}
